cask_args appdir: "/Applications"

# terminal
brew "direnv"
brew "tmux"
brew "zoxide"
# networking/system
brew "htop"
brew "btop"
brew "nmap"
brew "wget"

# compression
brew "gzip"
brew "unzip"

# file
brew "fzf"
brew "grep"
brew "jq"
brew "yq"
brew "less"
brew "stow"
brew "tree"

# ios/macos
brew "watchman"
brew "cocoapods"
brew "mas"

# js
brew "node"
brew "pnpm"

# python
brew "python"
brew "pyenv"

# java
brew "jenv"

# dev
brew "k9s"
brew "gh"
brew "railway"
brew "cmake"
brew "docker"
brew "act"
brew "kustomize"
brew "argocd"

# db
brew "postgresql"
brew "sqlite"
brew "redis"

# security
brew "amass"

# casks
cask "figma"
cask "cmux"
cask "orbstack"
cask "stats"
cask "sf-symbols"

